tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "iamchokerman/ani-cli"
tap "koekeishiya/formulae"
brew "automake"
brew "bat"
brew "python@3.9"
brew "glib"
brew "cmake"
brew "libtool"
brew "gnutls"
brew "harfbuzz"
brew "fftw"
brew "figlet"
brew "fzf"
brew "iniparser"
brew "jq"
brew "python@3.10"
brew "ncurses"
brew "neofetch"
brew "neovim"
brew "node"
brew "onefetch"
brew "pfetch"
brew "pyenv"
brew "ranger"
brew "scrcpy"
brew "spotify-tui"
brew "tmate"
brew "tree"
brew "unar"
brew "wget"
brew "youtube-dl"
brew "zsh-autosuggestions"
brew "zsh-fast-syntax-highlighting"
brew "zsh-history-substring-search"
brew "iamchokerman/ani-cli/ani-cli"
cask "alacritty"
cask "amethyst"
cask "android-platform-tools"
cask "betterdiscord-installer"
cask "font-sf-mono"
cask "iterm2"
cask "scilab"
cask "temurin8"
cask "vlc"
